{
  "name": "แผนการศึกษาปี 2555 (เคมี - โครงงาน)",
  "data": [
    {
      "year": 1,
      "semester": 1,
      "courses": [
        {
          "id": "01418114",
          "name": "Introduction to Computer Science",
          "credit": 4,
          "description": "Development of computers, data representation in computers, number systems, computer hardware components, computer performance metrics, system software, compilers and programming languages, problem solving, algorithm design and development, structural programming techniques, complexity in computer systems, computer system organization, naming, client-server architecture, virtualization, performance, computer networks, fault tolerance, atomicity, consistency, information security, parallel and distributed computer systems, current applications of computer systems, computer ethics.",
          "difficulty": 25
        },
        {
          "id": "01418131",
          "name": "Digital Computer Logic",
          "credit": 3,
          "description": "Basic logic design, representation of both data and information by digital signals, coding, number representation and arithmetic, computer architecture.",
          "difficulty": 20
        },
        {
          "id": "01420115",
          "name": "Laboratory in Abridged Physics",
          "credit": 1,
          "description": "N/A",
          "difficulty": 25
        },
        {
          "id": "01420119",
          "name": "Abridged Physics",
          "credit": 3,
          "description": "N/A",
          "difficulty": 25
        }
      ]
    },
    {
      "year": 1,
      "semester": 2,
      "courses": [
        {
          "id": "01417111",
          "name": "Calculus I",
          "credit": 3,
          "description": "Limits and continuity, derivatives and applications, differentials and applications, integration and applications.",
          "difficulty": 50
        },
        {
          "id": "01418116",
          "name": "Computer Programming",
          "credit": 3,
          "description": "Programming with a high-level language, input/output statements, variables, conditional statements, functions, procedural abstractions, unit testing, functional programming, recursion, repetition statements, basic data structures, data abstractions, object-oriented programming, classes, interface and implementation, inheritance, polymorphisms, multiple inheritance, and mixin.",
          "difficulty": 28,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418114"
            ]
          }
        },
        {
          "id": "01403111",
          "name": "General Chemistry",
          "credit": 4,
          "description": "Atoms and atomic structures, periodic system, chemical bonds, chemical reactions, gases, liquids, solids, solutions, thermodynamics, chemical kinetics, chemical equilibria, electrolytes and their ionization, acids and bases, ionic equilibria, electrochemistry.",
          "difficulty": 60
        }
      ]
    },
    {
      "year": 2,
      "semester": 1,
      "courses": [
        {
          "id": "01417112",
          "name": "Calculus II",
          "credit": 3,
          "description": "Space geometry, partial derivatives, multiple integrals, elementary differential equations.",
          "difficulty": 55,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01417111"
            ]
          }
        },
        {
          "id": "01418132",
          "name": "Fundamentals of Computing",
          "credit": 4,
          "description": "Theory of discrete computing, probability and statistics, implementation and application in computer science",
          "difficulty": 40
        },
        {
          "id": "01418217",
          "name": "Software Construction",
          "credit": 3,
          "description": "Programming with a statically-typed object-oriented language, types, objects, classes, subclasses, interfaces, abstract classes, exceptions, method call semantics, type hierarchy, software specifications, representation invariant, decoupling, module dependency diagrams, behavioral diagrams, refactoring, design patterns, object-oriented design principles, event-based programming, concurrent programming.",
          "difficulty": 35,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418116"
            ]
          }
        },
        {
          "id": "01418231",
          "name": "Data Structures",
          "credit": 3,
          "description": "Data structures, algorithms for implementation of lists, stacks, queues, trees and graphs, file structures and file processing.",
          "difficulty": 45,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418116"
            ]
          }
        }
      ]
    },
    {
      "year": 2,
      "semester": 2,
      "courses": [
        {
          "id": "01417322",
          "name": "Introductory Linear Algebra",
          "credit": 3,
          "description": "Vector spaces, linear transformations and matrices, systems of linear equations, eigenvalues, eigenvectors, diagonalization, applications.",
          "difficulty": 60,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01417112"
            ]
          }
        },
        {
          "id": "01418216",
          "name": "Principles of Programming Languages",
          "credit": 3,
          "description": "Language definition structure, syntax and semantics, lexical analysis and parsing, data types and structures, control structures, subprograms.",
          "difficulty": 30,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418116"
            ]
          }
        },
        {
          "id": "01418221",
          "name": "Fundamentals of Database Systems",
          "credit": 3,
          "description": "Introduction to database concepts, goals of database management system, data independence, integrity and reliability, logical and physical organizations; schema and subschema, data models, hierarchical, network and relational models, data normalization, data description languages, data dictionary, query facilities, file organization, file security.",
          "difficulty": 40,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418116"
            ]
          }
        },
        {
          "id": "01418232",
          "name": "Algorithm Design and Analysis",
          "credit": 3,
          "description": "Basic concepts of algorithms, mathematical analysis of algorithms, analysis of sorting and searching algorithms, algorithmic techniques, algorithm design methods.",
          "difficulty": 65,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418231"
            ]
          }
        },
        {
          "id": "01422111",
          "name": "Principles of Statistics",
          "credit": 3,
          "description": "Concept of statistics, measures of relative standing, measures of center, measures of dispersion, random variables and their probability distributions, binomial distribution, Poisson distribution, normal distribution, sampling distribution, statistical inference for one and two populations, analysis of frequency data, one-way analysis of variance, simple linear regression analysis.",
          "difficulty": 70
        }
      ]
    },
    {
      "year": 3,
      "semester": 1,
      "courses": [
        {
          "id": "01418321",
          "name": "System Analysis and Design",
          "credit": 3,
          "description": "Basic analysis steps, system analysis tools, systems flowchart, decision table and decision tree, feasibility study, cost effective analysis, input, output and design, computer process design, documentation, implementation and evaluation, proving the design, case studies.",
          "difficulty": 40,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418221"
            ]
          }
        },
        {
          "id": "01418331",
          "name": "Assembly Language and Computer Architecture",
          "credit": 4,
          "description": "Assembly language structure, addressing techniques, file input/output, program segmentation and linkage, assembly program construction, computer architecture characteristics, effect on the design and performance of system, price-performance tradeoffs, instruction sets design, CPU, I/O system, pipelining, vector and RISCs architecture, parallel architectures.",
          "difficulty": 40,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418116",
              "01418131"
            ]
          }
        },
        {
          "id": "01418351",
          "name": "Computer Communications and Protocols",
          "credit": 3,
          "description": "Communication concept, components of computer communications and networks, type of computer networks, protocol standards and layers, application layer protocols, network application architectures and programming, transport layer protocols.",
          "difficulty": 40,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418116"
            ]
          }
        }
      ]
    },
    {
      "year": 3,
      "semester": 2,
      "courses": [
        {
          "id": "01132101",
          "name": "Modern Entrepreneur",
          "credit": 3,
          "description": "Concepts of business in the administration in the globalization era, roles and the significance of modern business administration, business plan elements and writing, competency preparation for being an entrepreneur, business feasibility analysis, risk management.",
          "difficulty": 15
        },
        {
          "id": "01418332",
          "name": "Operating Systems",
          "credit": 4,
          "description": "Development of computer architecture and operating systems, operating system structure, processes and threads, scheduling, deadlocks, memory hierarchy, memory management, virtual memory, file system management, input output system management, security, protection, distributed operating systems.",
          "difficulty": 60,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418331"
            ]
          }
        },
        {
          "id": "01418333",
          "name": "Formal Language and Automata Theory",
          "credit": 3,
          "description": "Finite state concept, acceptors, regular expressions, closure properties, sequential machine and finite state transducers, state minimization, formal language grammars, computability and Turing machines.",
          "difficulty": 50,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418132"
            ]
          }
        },
        {
          "id": "01418343",
          "name": "Intellectual Property for Software and Digital Contents",
          "credit": 3,
          "description": "Professional ethics, categories of intellectual propertyacquisition of copyright, rights of copyright holder and author, copyright infringement and exceptions, performer’s rights, information access and rights of privacy, free software license, free documentation license, shrink wrap license, electronics transaction law, electronic signature, computer crime, case studies.",
          "difficulty": 30
        },
        {
          "id": "01418497",
          "name": "Seminar",
          "credit": 1,
          "description": "Presentation and discussion on current interesting topics in computer science at the bachelor’s degree level.",
          "difficulty": 70,
          "prerequisite": {
            "type": "ONE",
            "ids": [
              "01418216",
              "01418221",
              "01418232"
            ]
          }
        }
      ]
    },
    {
      "year": 4,
      "semester": 1,
      "courses": [
        {
          "id": "01418399",
          "name": "Computer Science Project Preparation",
          "credit": 1,
          "description": "Computer science practice, necessary basic skills for system analysis and design, related technology, software development tool usage, data gathering, data analysis and design, report writing and presentation, prototype demonstration.",
          "difficulty": 30,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418321"
            ]
          }
        }
      ]
    },
    {
      "year": 4,
      "semester": 2,
      "courses": [
        {
          "id": "01418499",
          "name": "Computer Science Project",
          "credit": 3,
          "description": "Project of practical interest in various fields of computer science.",
          "difficulty": 90,
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418399"
            ]
          }
        }
      ]
    }
  ]
}
