{
  "name": "แผนการศึกษาปี 2561",
  "data": [
    {
      "year": 1,
      "semester": 1,
      "courses": [
        {
          "id": "01417111",
          "name": "Calculus I",
          "credit": 3,
          "description": "Limits and continuity, derivatives and applications, differentials and applications, integration and applications."
        },
        {
          "id": "01418112",
          "name": "Fundamental Programming Concepts",
          "credit": 3,
          "description": "Computational thinking. Logical reasoning. Problem solving. Basic program design and development. Programming tools. Structural programming techniques. Control structures. Program execution. Program tracing and debugging.",
          "prerequisite": {
            "type": "TOGETHER",
            "ids": [
              "01418114"
            ]
          }
        },
        {
          "id": "01418114",
          "name": "Introduction to Computer Science",
          "credit": 2,
          "description": "Development of computers. Data representation in computers. Number systems. Computer hardware components. Computer performance metrics. System software. Compilers and programming languages. Complexity in computer systems. Computer system organization. Client- server architecture. Computer networks. Information security. Current applications of computer systems. Computer ethics."
        },
        {
          "id": "01420245",
          "name": "Introduction to Digital Electronics",
          "credit": 2,
          "description": "N/A"
        },
        {
          "id": "01420246",
          "name": "Laboratory in Introduction to Digital Electronics",
          "credit": 1,
          "description": "N/A"
        },
        {
          "id": "01999111",
          "name": "Knowledge of the Land",
          "credit": 2,
          "description": "History, uniqueness and identity of Kasetsart University. Knowledge of the land for the well‐being of nation. Learning from role models. Realization of being a Thai and a world’s citizen. Reinforcement and development of learning skills and goal-oriented work within the context of integrity, determination, knowledge creation and unity."
        }
      ]
    },
    {
      "year": 1,
      "semester": 2,
      "courses": [
        {
          "id": "01417112",
          "name": "Calculus II",
          "credit": 3,
          "description": "Space geometry, partial derivatives, multiple integrals, elementary differential equations.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01417111"
            ]
          }
        },
        {
          "id": "01418113",
          "name": "Computer Programming",
          "credit": 3,
          "description": "High-level language programming. Types. Variables. Input/output statements. Conditional statements. Repetition statements. Functions. Procedural abstractions. Recursion. File input and output. Basic data structures. Data abstractions. Objects and class definitions. Object attributes and behaviors. Program debugging and testing. Good programming practice.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418112"
            ]
          }
        },
        {
          "id": "01418132",
          "name": "Fundamentals of Computing",
          "credit": 4,
          "description": "Theory of discrete computing. Probability and statistics. Implementation and application in computer science."
        }
      ]
    },
    {
      "year": 2,
      "semester": 1,
      "courses": [
        {
          "id": "01417322",
          "name": "Basic Linear Algebra",
          "credit": 3,
          "description": "Vector spaces, linear transformations and matrices, systems of linear equations, eigenvalues, eigenvectors, diagonalization, applications.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01417112"
            ]
          }
        },
        {
          "id": "01418211",
          "name": "Software Construction",
          "credit": 3,
          "description": "Object-oriented programming. Objects. Classes. Object-oriented design principles. Composition. Inheritance. Polymorphisms. Interfaces. Abstract classes. Exceptions. Type hierarchy. Class dependency diagrams. Representation invariant. Dynamic data structures. Event-based prOgramming. Refactoring. Design patterns.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418113"
            ]
          }
        },
        {
          "id": "01418231",
          "name": "Data Structures",
          "credit": 3,
          "description": "Data structures. Algorithms for implementation of lists, stacks, queues, trees and graphs. File structures and file processing.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418113"
            ]
          }
        },
        {
          "id": "01422111",
          "name": "Principles of Statistics",
          "credit": 3,
          "description": "Concept of statistics, measures of relative standing, measures of center, measures of dispersion, random variables and their probability distributions, binomial distribution, Poisson distribution, normal distribution, sampling distribution, statistical inference for one and two populations, analysis of frequency data, one-way analysis of variance, simple linear regression analysis."
        }
      ]
    },
    {
      "year": 2,
      "semester": 2,
      "courses": [
        {
          "id": "01418221",
          "name": "Fundamentals of Database Systems",
          "credit": 3,
          "description": "Introduction to database concepts. Goals of database management system. Data independence. Integrity and reliability. Logical and physical organizations. Schema and subschema. Data models. Relational models. Data normalization. Data description languages. Data dictionary.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418113"
            ]
          }
        },
        {
          "id": "01418232",
          "name": "Algorithms Design and Analysis",
          "credit": 3,
          "description": "Basic concepts of algorithms. Mathematical analysis of algorithms. Analysis of sorting and searching algorithms. Algorithmic techniques. Algorithm design methods.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418132",
              "01418231"
            ]
          }
        },
        {
          "id": "01418233",
          "name": "Assembly Language and Computer Architecture",
          "credit": 4,
          "description": "Assembly language structure. Addressing techniques. File input/output. Program segmentation and linkage. Assembly program construction. Computer architecture characteristics. Effect on the design and performance of system. Price-performance tradeoffs. Instruction sets design. CPU. I/O system. Pipelining. Vector and RISC architecture. Parallel architectures.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418113",
              "01420245"
            ]
          }
        }
      ]
    },
    {
      "year": 3,
      "semester": 1,
      "courses": [
        {
          "id": "01418321",
          "name": "System Analysis and Design",
          "credit": 3,
          "description": "Basic analysis steps. System analysis tools. Systems flowchart. Decision table and decision tree. Feasibility study. Cost effective analysis. Input, output and design. Computer process design. Documentation. Implementation and evaluation. Proving the design. Case studies.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418211",
              "01418221"
            ]
          }
        },
        {
          "id": "01418331",
          "name": "Operating Systems",
          "credit": 4,
          "description": "Development of computer architecture and operating systems. Operating system structure. Processes and threads. Scheduling. Deadlocks. Memory hierarchy. Memory management. Virtual memory. File system management. Input/output system management. Security. Protection. Distributed operating systems.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418233"
            ]
          }
        },
        {
          "id": "01418341",
          "name": "Intellectual Properties and Professional Ethics",
          "credit": 3,
          "description": "Categories of intellectual property. Acquisition of copyright. Exclusive rights of copyright holder. Copyright infringement. Fair use. Free software license. Open source software license. Shrink wrap license. Creative Commons. Patent. Trade mark and service mark. Privacy policy. Computer crime. Case studies."
        },
        {
          "id": "01418497",
          "name": "Seminar",
          "credit": 1,
          "description": "Presentation and discussion on current interesting topics in computer science at the bachelor’s degree level.",
          "prerequisite": {
            "type": "ONE",
            "ids": [
              "01418221",
              "01418232",
              "01418233"
            ]
          }
        }
      ]
    },
    {
      "year": 3,
      "semester": 2,
      "courses": [
        {
          "id": "01418332",
          "name": "Infomation System Security",
          "credit": 3,
          "description": "Introduction to digital security. Auditing. Accountability and security policy. Cryptography. Operation security. Physical, network and operating system security. Security in various applications: secure coding, web and Internet of Things security.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418331"
            ]
          }
        },
        {
          "id": "01418333",
          "name": "Automata Theory",
          "credit": 2,
          "description": "Finite state concept. Acceptors. Regular expressions. Closure properties. Sequential machine and finite state transducers. State minimization. Formal language grammars. Turing machines.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418132"
            ]
          }
        },
        {
          "id": "01418334",
          "name": "Compiler Techniques",
          "credit": 2,
          "description": "Compilers and translators. Phases of a compiler. Notation and concepts for languages and grammars. Lexical analysis. Parse trees and derivations. Ambiguity. Parsing techniques. Symbol table. Intermediate representation. Semantic analysis and code generation.",
          "prerequisite": {
            "type": "TOGETHER",
            "ids": [
              "01418333"
            ]
          }
        },
        {
          "id": "01418351",
          "name": "Computer Communications and Cloud Computing Principles",
          "credit": 3,
          "description": "Communication concepts: wired. Wireless and cellular networks. Components of computer communications and networks. Type of computer networks. Protocol standards and layers. Application layer protocols. Network application architectures and programming. Transport-layer protocols. Software defined networks. Cloud computing. Components and services.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418331"
            ]
          }
        },
        {
          "id": "01418390",
          "name": "Cooperative Education Preparation",
          "credit": 1,
          "description": "Principles. Concepts and processes of cooperative education. Related rules and regulations. Basic knowledge and techniques in job application and working. Basic knowledge. Communication and human relations. Personality development. Quality management system in workplace. Presentations techniques. Report writing.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418321"
            ]
          }
        }
      ]
    },
    {
      "year": 4,
      "semester": 1,
      "courses": [
        {
          "id": "01418490",
          "name": "Cooperative Education",
          "credit": 6,
          "description": "On the job training as a temporary employee according to the assigned project including report and presentation.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418390"
            ]
          }
        }
      ]
    },
    {
      "year": 4,
      "semester": 2,
      "courses": [
        {
          "id": "01418499",
          "name": "Computer Science Project",
          "credit": 3,
          "description": "Project of practical interest in various fields of computer science.",
          "prerequisite": {
            "type": "ALL",
            "ids": [
              "01418321"
            ]
          }
        }
      ]
    }
  ]
}
